controllers/UserController.php

SELECT * FROM `user` WHERE `id`=11
---
   public function actionPassword(){
           if (Yii::$app->request->isAjax) {
              $checkPswd =  Yii::$app->request->post('data');
              $idToUpdate =  \Yii::$app->user->id;
              $model = User::find()->where(['id' => $idToUpdate])->one();