components/ProfileWidget.php

    public function run()
    {
        $id =  \Yii::$app->user->id;
        $model = User::find()->where(['id' => $id])->one();
        $profile = Profile::find()->where(['user_id' => $id])->one();
        if($model->load(Yii::$app->request->post()) && $profile->load(Yii::$app->request->post())){


            $profile->validate();
            //$model->validate();
            if($profile->errors || $model->errors){
                    foreach($model->errors as $error){
                            \Yii::$app->getSession()->setFlash('profile_update_error', $error[0]);
                    }
                    foreach($profile->errors as $error){
                            \Yii::$app->getSession()->setFlash('profile_update_error', $error[0]);
                    }

                    return $this->render('profile', [
                             'model' => $model,
                             'profile' => $profile
                     ]);
//                print_r($profile->errors);
//                die;
            };
			if($profile->password){
				$model->setPassword($profile->password);
			}
			$model->save();
            $profile->save();
---
SELECT * FROM `user` WHERE `id`=32
SELECT * FROM `user_profile` WHERE `user_id`=32
SELECT 1 FROM `user` WHERE `id`=32
UPDATE `user_profile` SET `profile_url`='', `short_description`='' WHERE `profile_id`=22