components/SignUp.php

    public function run()
    {
      	$model = new User();
	$profile = new Profile();

        if ($model->load(Yii::$app->request->post()) && $profile->load(Yii::$app->request->post()) ) {
			$model->validate();
			if($model->errors){
				foreach($model->errors as $error){
					\Yii::$app->getSession()->setFlash('email_reg_error', $error[0]);
				}

				return $this->render('register', [
					'model' => $model,
					'profile' => $profile,
				]);

			}
			else{
				$model->setPassword($model->password);
				$model->generateAuthKey();

				if($model->save(false)){

                                        $profile->user_id = $model->id;
					$profile->save();
---
INSERT INTO `user` (`username`, `email`, `status`, `password_hash`, `auth_key`, `created_at`, `updated_at`) VALUES ('lemmi', 'lemmis@jbsd.com', 10, '$2y$13$BAt5ssxBV.1RiemQstLc6ODwpWUav6T6CI839Ws3/.L9w7tNDdVze', 'yLDBdaRsTEydXcgbvKAgRBsY3UyrjUy7', 1464000753, 1464000753)
INSERT INTO `user_profile` (`firstname`, `lastname`, `user_id`) VALUES ('Anu', 'Siby', 32)