models/Tag.php

SELECT * FROM `tags`
---
    public function getAllTags() {

	return ArrayHelper::map($this->find()->all(), 'tag_id', 'name');