models/User.php

SELECT * FROM `user_profile` WHERE `user_id`=32
SELECT * FROM `user` WHERE (`id`=32) AND (`status`=10)
---
    public static function findIdentity($id)
    {

		$profile = UserProfile::find()->where(['user_id'=>$id])->one();
			$user = static::findOne(['id' => $id, 'status' => self::STATUS_ACTIVE]);